In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("train.csv")
df_test = pd.read_csv("test.csv")
test_ids = df_test["PassengerId"]
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#Lets understand our data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
#We can get rid off a few columns that wont the usefull to us
df = df.drop(["Ticket", "Cabin", "Name", "PassengerId"], axis = 1)

In [5]:
#Let fill the NaN values in age with the average age
x = round(df["Age"].mean())
df["Age"] = df["Age"].fillna(x)

In [6]:
#Lets fill the NaN values in Embarked with "U", meaning unknown
df["Embarked"] = df["Embarked"].fillna("U")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [8]:
#Now we need to transform the male and female category into 0 and 1

In [9]:
sex_is_male = df["Sex"] == "male"

In [10]:
df.loc[sex_is_male, "Sex"] = 1

In [11]:
sex_is_female = df["Sex"] == "female"
df.loc[sex_is_female, "Sex"] = 0

In [12]:
#We also need to transform to numbers the Embarked column
#We are going to set S = 0, C = 1, Q = 2 and U = 3
df["Embarked"].value_counts()

S    644
C    168
Q     77
U      2
Name: Embarked, dtype: int64

In [13]:
embarked_is_S = df["Embarked"] == "S"
embarked_is_C = df["Embarked"] == "C"
embarked_is_Q = df["Embarked"] == "Q"
embarked_is_U = df["Embarked"] == "U"
df.loc[embarked_is_S, "Embarked"] = 0
df.loc[embarked_is_C, "Embarked"] = 1
df.loc[embarked_is_Q, "Embarked"] = 2
df.loc[embarked_is_U, "Embarked"] = 3

In [14]:
#Lets apply the same changes to our test dataset
df_test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [15]:
df_test = df_test.drop(["Ticket", "Cabin", "Name", "PassengerId"], axis = 1)

In [16]:
x2 = round(df_test["Age"].mean())
df_test["Age"] = df_test["Age"].fillna(x2)
df_test["Embarked"] = df_test["Embarked"].fillna("U")

In [17]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

In [18]:
x3 = round(df_test["Fare"].mean())
df_test["Fare"] = df_test["Fare"].fillna(x3)

In [19]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

In [20]:
sex_is_male2 = df_test["Sex"] == "male"
df_test.loc[sex_is_male2, "Sex"] = 1

In [21]:
sex_is_female2 = df_test["Sex"] == "female"
df_test.loc[sex_is_female2, "Sex"] = 0

In [22]:
embarked_is_S2 = df_test["Embarked"] == "S"
embarked_is_C2 = df_test["Embarked"] == "C"
embarked_is_Q2 = df_test["Embarked"] == "Q"
embarked_is_U2 = df_test["Embarked"] == "U"
df_test.loc[embarked_is_S2, "Embarked"] = 0
df_test.loc[embarked_is_C2, "Embarked"] = 1
df_test.loc[embarked_is_Q2, "Embarked"] = 2
df_test.loc[embarked_is_U2, "Embarked"] = 3

In [23]:
df_test

     Pclass Sex   Age  SibSp  Parch      Fare Embarked
0         3   1  34.5      0      0    7.8292        2
1         3   0  47.0      1      0    7.0000        0
2         2   1  62.0      0      0    9.6875        2
3         3   1  27.0      0      0    8.6625        0
4         3   0  22.0      1      1   12.2875        0
..      ...  ..   ...    ...    ...       ...      ...
413       3   1  30.0      0      0    8.0500        0
414       1   0  39.0      0      0  108.9000        1
415       3   1  38.5      0      0    7.2500        0
416       3   1  30.0      0      0    8.0500        0
417       3   1  30.0      1      1   22.3583        1

[418 rows x 7 columns]

In [24]:
#Now our dataSet is clean, we can start an exploratory analysis

In [25]:
#Lets check how many male survivors we have
mask = df["Sex"] == 1
df_man = df[mask]
df_man["Survived"].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [26]:
# we can see that 109 man survived the disaster and 468 died, lets check the rate
survivor_among_man = round(109 / 577, 2) * 100
survivor_among_man

19.0

In [27]:
#19% was the survivor rate among man

In [28]:
#Lets check how many female survivors we have
mask2 = df["Sex"] == 0
df_female = df[mask2]
df_female["Survived"].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [29]:
survivor_among_female = round(233 / 314, 2) * 100
survivor_among_female

74.0

In [30]:
#74% was the survivor rate among female

In [31]:
#Lets find out the average age for the survivors (man)
age_man1 = round(df_man["Age"].mean(), 2)
age_man1

30.57

In [32]:
#30.73 years is the average age among all man
mask3 = df_man["Survived"] == 1
df_man2 = df_man[mask3]
df_man2
age_man_survivor = round(df_man2["Age"].mean(), 2)
age_man_survivor

27.68

In [33]:
#27.28 years is the average age among the survivors (man)

In [34]:
#Lets find out the average age for the survivors (female)
age_female1 = round(df_female["Age"].mean(), 2)
age_female1

28.27

In [35]:
#27.92 years is the average age among all female
mask4 = df_female["Survived"] == 1
df_female2 = df_female[mask4]
df_female2
age_female_survivor = round(df_female2["Age"].mean(), 2)
age_female_survivor

29.03

In [36]:
#28.85 years is the average age among the survivors (female)

In [37]:
#Let see if there is any relation between the ticket class and the survival rate
#We are going to group the analize now, male + female
df["Pclass"] = df["Pclass"].astype(int)
mask5 = df["Pclass"] == 1
df_first_class = df[mask5]
df_first_class["Survived"].value_counts()

1    136
0     80
Name: Survived, dtype: int64

In [38]:
first_class_survival_rate = round(136/216, 2) * 100
first_class_survival_rate

63.0

In [39]:
# The survival rate for the first class was 63%

In [40]:
mask6 = df["Pclass"] == 2
df_second_class = df[mask6]
df_second_class["Survived"].value_counts()

0    97
1    87
Name: Survived, dtype: int64

In [41]:
second_class_survival_rate = round(87/184, 2) * 100
second_class_survival_rate

47.0

In [42]:
# The survival rate for the second class was 47%

In [43]:
mask7 = df["Pclass"] == 3
df_third_class = df[mask7]
df_third_class["Survived"].value_counts()

0    372
1    119
Name: Survived, dtype: int64

In [44]:
third_class_survival_rate = round(119/491, 2) * 100
third_class_survival_rate

24.0

In [45]:
# The survival rate for the third class was 24%

In [46]:
# As we can see, the third class ticket had the highest death rate among all three

In [47]:
#Modeling prediction

In [48]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [49]:
y = df["Survived"]
x = df.drop("Survived", axis = 1)
x_train, x_val, y_train, y_val = train_test_split(x, y, test_size=0.2, random_state=42)

In [50]:
clf = LogisticRegression(random_state=0, max_iter=1000).fit(x_train, y_train)

In [51]:
predictions = clf.predict(x_val)
from sklearn.metrics import accuracy_score
accuracy_score(y_val, predictions)

0.7988826815642458

In [52]:
submission_pred = clf.predict(df_test)

In [53]:
dfinal = pd.DataFrame({"PassengerId": test_ids.values, "Survived":submission_pred})

In [54]:
dfinal.to_csv("submission.csv", index = False)